Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/mems.tmx
Source language: ca
Languages: es_es

source: El programa està bàsicament concebut com una ajuda a les persones que volen començar a generar documents en valencià (entre altres eines, inclou una completíssima guia interactiva de gramàtica i estil).
es_es: El programa está básicamente concebido como una ayuda a las personas que quieren empezar a generar documentos en valenciano (entre otras herramientas, incluye una completísima guía interactiva de gramática y estilo).

source: El programa pot ser interactiu i preguntar (al final de la traducció o durant el procés) a la persona usuària com ha de resoldre algunes ambigüitats, i dialoga sempre en català; a més, l'usuari pot seguir visualment el procés de traducció (mot a mot amb modificacions locals) en dues passades.
es_es: El programa puede ser interactivo y preguntar (al final de la traducción o durante el proceso) a la persona usuaria cómo tiene que resolver algunas ambigüedades, y dialoga siempre en catalán; además, el usuario puede seguir visualmente el proceso de traducción (palabra a palabra con modificaciones locales) en dos pasadas.

source: El programa que permet fer, entre altres, aquestes operacions de manera senzilla o fins i tot automàtica (aspecte molt important quan la base de dades conté milers de registres) és un programa gestor de bases de dades, o bé l'inclou o l'invoca.
es_es: El programa que permite hacer, entre otros, estas operaciones de manera sencilla o incluso automática (aspecto muy importante cuando la base de datos contiene miles de registros) es un programa gestor de bases de datos, o bien lo incluye o lo invoca.

source: El projecte va estimular la investigació a tot Europa, però va ser abandonat finalment el 1992.
es_es: El proyecto estimuló la investigación en toda Europa, pero fue abandonado finalmente en 1992.

source: El seu objectiu era la construcció d'un sistema de transferència multilingüe que permetera la traducció entre totes les llengües de la Comunitat Europea.
es_es: Su objetivo era la construcción de un sistema de transferencia multilingüe que permitiera la traducción entre todas las lenguas de la Comunidad Europea.

source: El sistema comercial més sofisticat dels 1980 és Metal (1988), finançat per Siemens i que tradueix de l'alemany a l'anglés.
es_es: El sistema comercial más sofisticado de 1980 es Metal (1988), financiado por Siemens y que traduce del alemán al inglés.

source: El sistema de traducció automàtica Es-Ca, originalment desenvolupat per l'empresa Incyta de Cornellà (que després d'una etapa en la qual va formar part de l'extinta multinacional Sail Labs, ha renascut amb el nom d'Incyta Multianguage, S.L.) en col·laboració amb la Universitat Autònoma de Barcelona és un sistema de transferència sintàctica estàndard, hereu del sistema METAL de l'empresa Siemens.
es_es: Bases de datos

source: El sistema de traducció automàtica el tradueix per 0,03$ n$ i corregir-lo costa 0,10$($10$/$100$) n$, és a dir, 0,01$ n$ euros perquè només 10 de cada 100 mots són incorrectes.
es_es: El sistema de traducción automática lo traduce por 0,03$ n$ y corregirlo cuesta 0,10$($10$/$100$) n$, es decir, 0,01$ n$ euros porque sólo 10 de cada 100 palabras son incorrectas.

source: El sistema de traducció automàtica el tradueix per 0,03$$1000$=$30 euros, i corregir-lo costa 10 euros, perquè en 1000 parules hi ha 1000$ $10$/$100$=$100 mots incorrectes i corregir cada un costa 0,10 euros: 0,10$$100$=$10.
es_es: El sistema de traducción automática lo traduce por 0,03$$1000$=$30 euros, y corregirlo cuesta 10 euros, porque en 1000 palabras hay 1000$ $10$/$100$=$100 palabras incorrectas y corregir cada uno cuesta 0,10 euros: 0,10$$100$=$10.

source: El sistema interNOSTRUM tracta aquests dos problemes amb l'analitzador morfològic, el qual és capaç de decidir quan un grup de mots s'ha de tractar conjuntament o per separat.
es_es: El sistema interNOSTRUM trata estos dos problemas con el analizador morfológico, el cual es capaz de decidir cuando un grupo de palabras se tiene que tratar conjuntamente o por separado.

source: El sistema no es distribueix com a programa, sinó que es troba en Internet ({http://www.incyta.com}): l'usuari inscrit envia el text i el servidor li'l retorna traduït; els costos en 1999 eren de 3 pessetes per paraula.
es_es: El sistema no se distribuye como programa, sino que se encuentra en Internet ({http://www.incyta.com}): el usuario inscrito envía el texto y el servidor se lo devuelve traducido; los costes en 1999 eran de 3 pesetas por palabra.

source: El sistema operatiu Linux permet construir una canonada (pipeline) o cadena de muntatge en la qual el text d'eixida d'un programa s'envia com a entrada a un altre (en comptes d'enviar-lo a la pantalla), i així successivament.
es_es: El sistema operativo Linux permite construir una cañería (pipeline) o cadena de montaje en la cual el texto de salida de un programa se envía como entrada a otro (en vez de enviarlo a la pantalla), y así sucesivamente.

source: El subprograma de tractament de patrons es genera automàticament a partir d'un fitxer de regles que especifica els patrons i les accions associades {garridoalenda01j}.
es_es: El subprograma de tratamiento de patrones se genera automáticamente a partir de un fichero de reglas que especifica los patrones y las acciones asociadas {garridoalenda01j}.

source: El terme hongarés és ``{{T1}{ec}{m}{n}Alfa simítási tényez{'256}}''; en el document d'exemple, els caràcters especials s'indiquen amb el seu codi Unicode (per exemple, +
es_es: El término húngaro es ``{{T1}{ec}{m}{n}Alfa simítási tényez{'256}}''; en el documento de ejemplo, los caracteres especiales se indican con su código Unicode (por ejemplo, +

source: El text, pràcticament inintel·ligible per a qui no sàpia basc: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bat hartu zuen.
es_es: El texto, prácticamente ininteligible para quien no sepa vasco: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bate hartu zuen.

source: El traductor català--espanyol està menys desenvolupat que el traductor espanyol--català.
es_es: El traductor catalán--español está menos desarrollado que el traductor español--catalán.

source: El traductor d'El Periódico de Catalunya i AutomaticTrans
es_es: El traductor de El Periódico de Cataluña y AutomaticTrans

source: El traductor s'executa actualment sobre el sistema operatiu Linux i és accessible, com ja s'ha dit, a través d'un servidor d'Internet; está constituït per 8 subprogrames independents que s'executen simultàniament (en paral·lel), elaboren la traducció per etapes i es comuniquen mitjançant canals de text ANSI legible (cosa que facilita enormement el diagnòstic dels errors de traducció).
es_es: El traductor se ejecuta actualmente sobre el sistema operativo Linux y es accesible, como ya se ha dicho, a través de un servidor de Internet; está constituido por 8 subprogramas independientes que se ejecutan simultáneamente (en paralelo), elaboran la traducción por etapas y se comunican mediante canales de texto ANSI legible (cosa que facilita enormemente el diagnóstico de los errores de traducción).

source: Elegiu tres mots de $L$ que tinguen aquest problema i descrigueu com els tractaríeu en un llenguatge controlat basat en $L$.
es_es: Elegid tres palabras de $L$ que tengan este problema y describid como los trataríais en un lenguaje controlado basado en $L$.

source: Ell - soler menjar més-d'un home aleshores; un temps, un temps aleshores, més-d'un home anar parlar gran home en més-d'un, cap en més-d'un, més-d'un - anar parlar ell aleshores, ell - dir: ``Molt-bé, vosaltres-i-jo haver-de trobar nou illa''.} I ara, veritat que s'entén una miqueta més?
es_es: Él - soler comer más-de un hombre entonces; un tiempo, un tiempo entonces, más-de un hombre ir hablar gran hombre en más-de uno, ninguno en más-de uno, más-de un - ir hablar él entonces, él - decir: ``Muy-bien, vosotros-y-yo haber-de encontrar nueva isla''.} Y ahora, ¿verdad que se entiende un poquito más?

source: Ell va dir: ``Molt bé, hem de trobar una nova illa''.} L'ordre dels mots no és molt diferent en tok pisin i en català i això fa que la traducció mot per mot siga prou llegidora.
es_es: Él dijo: ``Muy bien, tenemos que encontrar una nueva isla''.} El orden de las palabras no es muy diferente en tok pisin y en catalán y esto hace que la traducción palabra por palabra sea muy legible.

source: Els transductors d'estats finits usats en interNOSTRUM lligen l'entrada símbol a símbol; cada vegada que es llegeix una lletra canvien d'estat i van produint, també lletra a lletra, una o més sortides.
es_es: Los transductores de estados finitos usados en interNOSTRUM leen la entrada símbolo a símbolo; cada vez que se lee una letra cambian de estado y van produciendo, también letra a letra, una o más salidas.

source: Els camps poden ser de diversos tipus, segons la naturalesa de les dades que s'hi guarden (cadenes de caràcters, valors numèrics enters o amb decimals, dates de calendari, etc.)
es_es: Los campos pueden ser de varios tipos, según la naturaleza de los datos que se guardan (cadenas de caracteres, valores numéricos enteros o con decimales, fechas de calendario, etc.)

source: Els conceptes d'aquesta secció estan presos quasi íntegrament d'aquesta obra.
es_es: Los conceptos de esta sección están tomados casi íntegramente de esta obra.

source: Els fenòmens ``a la llarga'' com la concordança subjecte--predicat són una mica més difícils de tractar; s'usa un registre estat o memòria que recorda certes informacions al llarg del procés.
es_es: Los fenómenos "a la larga'' como la concordancia sujeto--predicado son algo más difíciles de tratar; se usa un registro estado o memoria que recuerda ciertas informaciones a lo largo del proceso.

source: Els gestors de terminologia són uns dels programes de MAHT (traducció humana assistida per una màquina; vegeu l'apartat ) més usats pels traductors.
es_es: Los gestores de terminología son unos de los programas de MAHT (traducción humana asistida por ordenador; ved el apartado ) más usado por los traductores.

source: Els metodes basats en exemples (vegeu el capítol ) s'aprofiten també de l'existència de grans corpora de textos traduïts (per això també s'en diu basats en memòria).
es_es: Los métodos basados en ejemplos (véase el capítulo ) se aprovechan también de la existencia de grandes corpora de textos traducidos (por eso también se llaman basados en memoria).

source: Els mètodes basats en corpus es poden dividir en dos grups: estadístics i basats en exemples.
es_es: Los métodos basados en corpus se pueden dividir en dos grupos: estadísticos y basados en ejemplos.

source: Els mètodes estadístics ja van ser considerats als anys seixanta, però aviat van ser descartats perquè els resultats obtinguts no eren acceptables.
es_es: Los métodos estadísticos ya fueron considerados en los sesenta, pero pronto fueron descartados porque los resultados obtenidos no eran aceptables.

source: Els paràgrafs següents en donen alguns exemples.
es_es: Los párrafos siguientes dan algunos ejemplos.

source: Els pocs errors en homògrafs difícils i freqüents, com ara una (article/verb, freqüència 0,77%), para (verb/prep., freqüència 0,77%) i como (conj./verb, freqüència 0,43%) degraden actualment molt la qualitat de la traducció.
es_es: Los pocos errores en homógrafos difíciles y frecuentes, como por ejemplo una (artículo/verbo, frecuencia 0,77%), para (verbo/prep., frecuencia 0,77%) y como (conj./verbo, frecuencia 0,43%) degradan actualmente mucho la calidad de la traducción.

source: Els principals corrents dins la TA des dels 70 són, per tant: eines de suport a la traducció per a traductors, sistemes de TA amb intervenció humana i recerca teòrica vers un sistema completament automàtic de traducció.
es_es: Las principales corrientes dentro de la TA desde los 70 son, por lo tanto: herramientas de apoyo a la traducción para traductores, sistemas de TA con intervención humana e investigación teórica a través de un sistema completamente automático de traducción.

source: Els projectes més notables són GETA-Ariane (Grenoble), SUSY (Saarbrücken), Mu (Kyoto), DLT (Utrecht), Rosetta (Eindhoven), el projecte de la Universitat Carnegie-Mellon (Pittsburgh) i dos projectes internacionals: Eurotra, finançat per la Comunitat Europea i el projecte japonés CICC amb participants a la Xina, Indonèsia i Tailàndia.
es_es: Los proyectos más notables son GETA-Ariane (Grenoble), SUSY (Saarbrücken), Mu (Kyoto), DLT (Utrecht), Rosetta (Eindhoven), el proyecto de la Universidad Carnegie-Mellon (Pittsburgh) y dos proyectos internacionales: Eurotra, financiado por la Comunidad Europea y el proyecto japonés CICC con participantes en China, Indonesia y Tailandia.

source: Els recursos de maquinari, programari i llenguatges de programació eren massa reduïts i la primera aproximació va ser la traducció mot per mot basada en diccionari amb algunes regles senzilles de reordenament (actualment anomenada traducció directa (vegeu l'apartat ).
es_es: Los recursos de hardware, software y lenguajes de programación eran demasiado reducidos y la primera aproximación fue la traducción palabra por palabra basada en un diccionario con algunas reglas sencillas de reordenamiento (actualmente llamada traducción directa (véase el apartado ).

source: Els registres d'una base de dades lèxica multilingüe poden contenir molts tipus de camps: El terme en cada una de les llengües (camps que normalment s'usen d'índex per a fer les recerques més eficients).
es_es: Los registros de una base de datos léxica multilingüe pueden contener muchos tipos de campos: El término en cada una de las lenguas (campos que normalmente se usan de índice para hacer las búsquedas más eficientes).

source: Els resultats del traductor, quan tenia una demostració disponible en Internet, eren molt acceptables en la major part dels casos (en l'actualitat no és possible avaluar el programa gratuïtament).
es_es: Los resultados del traductor, cuando tenía una demostración disponible en Internet, eran muy aceptables en la mayor parte de los casos (en la actualidad no es posible evaluar el programa gratuitamente).

source: Els resultats són molt interessants.
es_es: Los resultados son muy interesantes.

source: Els subprogrames d'anàlisi morfològica, consulta del diccionari bilingüe, generació morfològica i { postgeneració} estan basats en transductors d'estats finits, similars als descrits en l'epígraf .
es_es: Los subprogramas de análisis morfológico, consulta del diccionario bilingüe, generación morfológica y postgeneración { } están basados en transductores de estados finitos, similares a los descritos en el epígrafe .

source: Els traductors es van sentir amenaçats.
es_es: Los traductores se sintieron amenazados.

source: Els treballs a IBM van utilitzar el gran corpus de textos en anglés i francés resultants de les sessions del Parlament de Canadà.
es_es: Los trabajos de IBM utilizaron el gran corpus de textos en inglés y francés resultantes de las sesiones del Parlamento de Canadá.

source: Els usos civils de l'screening han superat actualment l'ús tradicional, el militar.
es_es: Los usos civiles del screening han superado actualmente el uso tradicional, el militar.

source: Els usuaris d'aquest tipus de sistemes es podrien classificar en tres grans grups: traductors ocasionals, traductors professionals individuals i traductors professionals que treballen per a empreses de traducció.
es_es: Los usuarios de este tipo de sistemas se podrían clasificar en tres grandes grupos: traductores ocasionales, traductores profesionales individuales y traductores profesionales que trabajan para empresas de traducción.

source: Els vaig veure caure. ja que això requereix l'ús de quantitats enormes de coneixement enciclopèdic sobre el funcionament del ``món real''.
es_es: Los vi caer. puesto que esto requiere el uso de cantidades enormes de conocimiento enciclopédico sobre el funcionamiento del ``mundo real''.

source: Els índexs contenen{}
es_es: Los índices contienen{}

source: Els índexs s'han de refer parcialment quan es fan altes, baixes o modificacions de registres per tal que les consultes continuen sent eficients.
es_es: Los índices se tienen que rehacer parcialmente cuando se hacen altas, bajas o modificaciones de registros para que las consultas continúen siendo eficientes.

source: En aquest capítol es descriuen breument cinc experiències de traducció automàtica de l'espanyol al català: SALT, Ara, Es-Ca, els traductors Automatictrans i el del El Periòdico de Catalunya i una altra, interNOSTRUM, amb una miqueta més de detall.
es_es: En este capítulo se describen brevemente cinco experiencias de traducción automática del español al catalán: SALT, Ara, Es-Ca, los traductores Automatictrans y el del El Periódico de Cataluña y otra, interNOSTRUM, con un poquito más de detalle.

source: En aquest cas, el nombre de consultes hauria estat de 5 i, doncs, es compleix l'afirmació anterior: la recerca dicotòmica mira com a molt $n$ fitxes si el fitxer té entre $2^{n-1}$ i $2^n$ fitxes; ací el nombre d'elements total (25) està entre $2^5=32$ i $2^4=16$, i el nombre d'elements consultats ha estat $n=5$.
es_es: En este caso, el número de consultas habría sido 5 y, así, se cumple la afirmación anterior: la búsqueda dicotómica mira como mucho $n$ fichas si el fichero tiene entre $2^{n-1}$ y $2^n$ fichas; aquí el número de elementos total (25) está entre $2^5=32$ y $2^4=16$, y el número de elementos consultados ha sido $n=5$.

source: En aquest cas, el sistema ha de saber: que els trets fereixen greument o maten les persones que els reben i que la condició de ferit greu o mort és incompatible amb mantenir-se dret, i que, per tot això, la interpretació més probable és que van caure els xiquets, no els soldats.
es_es: En este caso, el sistema tiene que saber: que los disparos hieren gravemente o matan las personas que los reciben y que la condición de herido grave o muerto es incompatible con mantenerse derecho, y que, por todo esto, la interpretación más probable es que cayeron los niños, no los soldados.

source: En aquests anys es consolida la idea que els sistemes de TA no són per a traductors; un traductor necessita eines que li faciliten el treball: diccionaris, bases de dades terminològiques (vegeu el capítol ), sistemes de comunicació, memòries de traducció (vegeu el capítol ), etc.
es_es: En estos años se consolida la idea que los sistemas de TA no son para traductores; un traductor necesita herramientas que le facilitan el trabajo: diccionarios, bases de datos terminológicas (véase el capítulo ), sistemas de comunicación, memorias de traducción (véase el capítulo ), etc.

source: En aquests sistemes interactius, cal tenir en compte dos factors: el primer, que un sistema que pregunta massa no és còmode d'usar (no és ergonòmic) i el segon, que pot passar que l'usuari siga monolingüe, circumstància que canvia molt la naturalesa de la interacció entre el programa i l'usuari.
es_es: En estos sistemas interactivos, hay que tener en cuenta dos factores: el primero, que un sistema que pregunta demasiado no es cómodo de usar (no es ergonómico) y el segundo, que puede pasar que el usuario sea monolingüe, circunstancia que cambia mucho la naturaleza de la interacción entre el programa y el usuario.

source: En canvi, en francés o en rus es parla, com en català o en espanyol, de { traduction automatique} o avtomatitxeski perevod, respectivament.
es_es: En cambio, en francés o en ruso se habla, como en catalán o en español, de { traduction automatique} o avtomatitxeski perevod, respectivamente.

source: En canvi, si el text original està en basc, les coses no són tan senzilles.
es_es: En cambio, si el texto original está en vasco, las cosas no son tan sencillas.

source: En el cas de l'screening, fins i tot una traducció incompleta a més d'incorrecta (per exemple, només dels mots terminològics) pot ser de gran utilitat.
es_es: En el caso del screening, incluso una traducción incompleta además de incorrecta (por ejemplo, sólo de las palabras terminológicas) puede ser de gran utilidad.

source: En el futur, molts d'aquests homògrafs s'inclouran en la definició d'un llenguatge controlat, alternativa a la preedició consistent en l'aplicació de restriccions lèxiques, sintàctiques i d'estil als textos de la LO.
es_es: En el futuro, muchos de estos homógrafos se incluirán en la definición de un lenguaje controlado, alternativa a la preedición consistente en la aplicación de restricciones léxicas, sintácticas y de estilo a los textos de la LO.

source: En el llenguatge controlat, es podria evitar el primer significat proposant els autors que feren servir el mot alternatiu { escondrijo}.
es_es: En el lenguaje controlado, se podría evitar el primer significado proponiendo los autores que usaron la palabra alternativa { escondrijo}.

source: En el moment d'escriure aquestes línies s'observa un resorgiment de les tècniques de traducció automàtica estadística com les que es van iniciar en IBM durant la dècada dels 1990; fins i tot han aparegut empreses que es proposen comercialitzar productes que aprenen el vocabulari i les regles de traducció directament de grans textos bilingües.
es_es: En el momento de escribir estas líneas se observa un resurgimiento de las técnicas de traducción automática estadística como las que se iniciaron en IBM durante los noventa; incluso han aparecido empresas que se proponen comercializar productos que aprenden el vocabulario y las reglas de traducción directamente de grandes textos bilingües.

source: En el primer cas, el text origen es prepara o adapta (preedita) per a millorar el comportament del sistema de traducció, eliminant, per exemple, l'ambigüitat del text, (vegeu l'apartat ), ja que pot voler dir exchange (reemplaçar) o put back (tornar a col·locar).} o també per a marcar parts del text que no han de ser traduïdes, com ara una citació, o que han de ser tractades de manera especial per no ser frases completes, com un títol.
es_es: En el primer caso, el texto origen se prepara o adapta (preedita) para mejorar el comportamiento del sistema de traducción, eliminando, por ejemplo, la ambigüedad del texto, (véase el apartado ), puesto que puede querer decir exchange (reemplazar) o put back (volver a colocar).} o también para marcar partes del texto que no tienen que ser traducidas, como por ejemplo una citación, o que tienen que ser tratadas de manera especial para no ser frases completas, como un título.

source: En el segon cas, el text meta produït pel sistema es refina o revisa ({ postedita}) perquè siga gramaticalment correcte o estiga escrit d'acord amb un registre determinat.
es_es: En el segundo caso, el texto meta producido por el sistema se refina o revisa ({ postedita}) para que sea gramaticalmente correcto o esté escrito de acuerdo con un registro determinado.

source: En els sistemes de traducció automàtica, la preedició... ... redueix la quantitat de postedició.
es_es: En los sistemas de traducción automática, la preedición... ... reduce la cantidad de postedición.

source: En els últims anys, especialment des que s'ha generalitzat l'accés públic a Internet, s'observa una tendència a incorporar sistemes de traducció automàtica com un dels components de sistemes més grans de comunicació.
es_es: En los últimos años, especialmente desde que se ha generalizado el acceso público a Internet, se observa una tendencia a incorporar sistemas de traducción automática como uno de los componentes de sistemas más grandes de comunicación.
